uncode-framework-ws/ws/soap_spring_cxf_wss4j/doc/inbound-2.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1">
            <wsse:UsernameToken wsu:Id="UsernameToken-f0480da4-0ed4-4c73-9cef-4e887aa14761">
                <wsse:Username>client</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">DwtYauMu1K6lkSYEXjfEy4rMjb0=</wsse:Password>
                <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">noRmie1nIwzBbp7hKjeYkw==</wsse:Nonce>
                <wsu:Created>2014-07-03T16:22:36.825Z</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <soap:Body>
        <ns2:say xmlns:ns2="http://soap_spring_cxf_wss4j.ws.demo/">
            <arg0>world</arg0>
        </ns2:say>
    </soap:Body>
</soap:Envelope>